Revit 2027 API
BuiltInFailures.ConnectorFailures.NetworkValidityError Property
 The family is connected in a network and can no longer keep the connectivity. Disconnect the family from the network?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkValidityError { get; }
Public Shared ReadOnly Property NetworkValidityError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkValidityError {
	FailureDefinitionId^ get ();
}
static member NetworkValidityError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace